# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "antigen"
brew "autojump"
brew "php"
brew "composer"
brew "gh"
brew "git"
brew "gnupg"
brew "mackup"
brew "mas"
brew "mkcert"
brew "php-code-sniffer"
brew "pinentry-mac"
brew "pyenv"
brew "shellcheck"
brew "wget"

# Fonts
cask "font-meslo-lg-nerd-font"

# Applications
cask "1password-beta"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "cleanshot"
cask "dash"
cask "docker"
cask "fig"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "kaleidoscope2"
cask "logi-options-plus"
cask "mysqlworkbench"
# cask "path-finder"
cask "paw"
cask "sip"
cask "tableplus"
cask "tower"
cask "transmit"
cask "visual-studio-code"
# cask "vmware-fusion"
cask "vmware-fusion-tech-preview"

# Mac App Store
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Pixelmator Pro", id: 1289583905
mas "PopClip", id: 445189367
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "Things", id: 904280696
mas "Transmit", id: 1436522307
mas "TrashMe 3", id: 1490879410
mas "Xcode", id: 497799835
